export interface BlogPost {
    id: number;
    title: string;
    category: string;
    image: string;
    summary: string;
    content: string; 
  }
  
  export const blogPosts: BlogPost[] = [
    {
      id: 1,
      title: 'Відновлення здоров’я волосся з TAKOSTA Liquid Silk',
      category: 'Статі',
      image: '../Images/blog/4-min.JPEG',
      summary: 'Liquid Silk — ідеальний засіб для тонкого та пошкодженого волосся. Відновлює структуру, створює захисну плівку, нормалізує обмін речовин та запобігає старінню волосся. Поверніть природний блиск та здоров’я вашому волоссю з TAKOSTA!',
      content: `Відновлення здоров’я волосся з TAKOSTA Liquid Silk

TAKOSTA Liquid Silk — це сучасний засіб, розроблений для догляду за тонким і сильно пошкодженим волоссям. Його унікальна формула націлена на глибоке відновлення та захист структури волосся.

1. Відновлення пошкодженої структури: засіб ефективно відновлює кінчики волосся, роблячи їх міцними та здоровими.
2. Захисна плівка: утворює легкий бар’єр на кожній волосинці, що сприяє зміцненню структури та запобігає ламкості.
3. Нормалізація обмінних процесів: TAKOSTA Liquid Silk підтримує жирний та білковий баланс волосся, забезпечуючи природний блиск і здоров’я.
4. Протидія старінню волосся: засіб запобігає передчасним віковим змінам, зберігаючи волосся молодим і доглянутим.

Результат — шовковисте, міцне та сяюче волосся, яке виглядає бездоганно. Відчуйте різницю вже після першого застосування!`

    },
  ];
  