export interface BlogPost {
    id: string;
    title: string;
    category: string;
    image: string;
    summary: string;
    content: string; 
  }
  
  export const blogPosts: BlogPost[] = [
    {
      id: 'Про кондиціонер',
      title: 'Про кондиціонер:',
      category: 'Статі',
      image: '../Images/blog/Condicioner.jpg',
      summary: `Ну хіба таке можливо?
Тааак… Це наша розробка. Для багатьох в ньому незвичайна консистенція, але…

От такий незвичайний кондиціонер, як дуже густа маска або баттер, але це саме кондиціонер.

Ми працювали не просто над кондиціонером, який буде згладжувати кутикулярний шар, а буде закривати ряд проблем з якими стикається сучасна жінка та при цьому не обтяжувати волосся. `,
      content: `Ну хіба таке можливо?
Тааак… Це наша розробка. Для багатьох в ньому незвичайна консистенція, але…

От такий незвичайний кондиціонер, як дуже густа маска або баттер, але це саме кондиціонер.

Ми працювали не просто над кондиціонером, який буде згладжувати кутикулярний шар, а буде закривати ряд проблем з якими стикається сучасна жінка та при цьому не обтяжувати волосся.

Якого ж результату ми досягли 

Conditioner for all hair types від TAKOSTA:
 - зволожує пошкоджені локони; 
 - надає здорового блиску; 
 - знімає статичну електрику;
 - полегшує укладання;
 - приборкує неслухняне та  кучеряве волосся;
 -  відновлює структуру тонких, сильно пошкоджених кінчиків;
 - створює легку плівку; 
 - волосся стає слухняним та шовковистим;
 - має зволожуючі властивості;
 - забезпечує антиоксидантну дію; 
 - зберігають водний баланс у волосяному стрижні;
 - покращує структуру волосся.

Користуйтесь із задоволенням!`

    },
    {
      id: 'Про склад шампуню',
      title: 'Про склад шампуню:',
      category: 'Статі',
      image: '../Images/blog/shampoo.jpg',
      summary: `ЧОМУСЬ ВІН ЯКОСЬ НЕ ТАК ПІНИТЬСЯ? 

Давайте розбиратися… 
За рахунок чого зʼявляється піна при використанні будь якого миючого засобу, включаючи: шампуні, гелі, рідке мило та ін. `,
      content: `Всі лякають ПАР (поверхнево активні речовини) - але… не так страшні ці компоненти, як про них розповідають. По-перше, в косметиці їх використовують у дуже малих відсотках, по відношенню до інших компонентів які застосовуються у виробництві продуктів. По-друге, походження ПАРів може бути різним за походженням. Чим більше натуральна речовина, тим менше вона піниться.

Ну, ще про один секретик  Якщо піна шампуню складається із дрібних бульбашок, то взагалі топ  Вона дбайливо, не травмуючи кутикулярний шар прибирає бруд та залишки стайлінгу.

Багато хто може сказати, що погано такі шампуні розпінюються. Рекомендуємо мити голову двічі, за другим нанесенням шампуню, піна буде більш стійкою. Навіть якщо шампунь дуже сильно піниться (зазвичай це шампуні з агресивними ПАР), це не означає, що з першого нанесення ви приберете повністю бруд та стайлінг з шкіри голови та волосся. 
Обираючи шампунь, звертайте увагу перш за все, на тип шкіри голови.`

    },
    {
      id: 'Про процедуру «ГАРЯЧІ НОЖИЦІ»',
      title: 'Про процедуру «ГАРЯЧІ НОЖИЦІ»',
      category: 'Статі',
      image: '../Images/blog/shampoo.jpg',
      summary: `Стрижка гарячими ножицями дозволяє акуратно закрити зріз кожного волоска, і поступово повертати волоссю їх здоровий і красивий вид.`,
      content: `Завдяки такому процесу вдається зберегти природну вологу і всі поживні речовини, адже - це запорука здоров’я Вашого волосся. Також волосся надійно захищене від шкідливого впливу навколишнього середовища. Посічені кінчики більше не будуть проблемою. 

Стрижка гарячими ножицями має безліч переваг, таких як: 
✔️ якісна стрижка та одночасно оздоровчий догляд; 
✔️ швидкий ефект вже після першого застосування; 
✔️ повна безпека для майстра і клієнта; 
✔️ можливість підібрати необхідну температуру виходячи від типу волосся; 
✔️ безмежність у виконанні стрижок. 

Дуже важливо при роботі з гарячими ножицями підібрати правильну температуру виходячи від типу волосся клієнта. 

Ефект від стрижки за допомогою гарячих ножиць: 
🔸 волосся менше плутається протягом усього дня і стає більш податливими та слухняним; 
🔸 волосся стає більш гладкими й м’якими, що значно відчувається при дотику; 
🔸 надається додатковий об’єм, що покращує вигляд укладки або зачіски; 
🔸 волосся набуває природний здоровий блиск, який є окрасою будь-якої зачіски; 
🔸 підвищується еластичність, волоски стають міцнішими; 
🔸 зникають посічені кінчики на довгий час.

Стрижка за допомогою гарячих ножиць спрямована, перш за все, на усунення ламкості волосся.`

    },
  ];
  