export interface Product {
  id: string;
  name: string;
  subname: string;
  category: string;
  description: string;
  shirtDescription: string;
  image: string;
  price: number;
  purpose: string; // Призначення
  hairType: string; // Тип волосся
  volume: string; // Обем
  note: string; // Примітка
  madeIn: string; // Зроблено
  composition: string; // Склад
  usage: string; // Спосіб використання
  link: string;
}

export const products: Product[] = [
  {
    id: "Shampoo Repair",
    name: "Shampoo",
    subname: "Repair",
    category: "Очищення",
    description:
      "Шампунь створений для сухого, пошкодженого, пористого, середнього та товстого волосся. Дбайливо та делікатно очищає волосся та шкіру голови.  Глибоко проникає в структуру волосся, насичуючи їх необхідними мікроелементами, живить, зволожує та відновлює пошкоджені ділянки волосся.",
    image: "./Images/CarouselProduct/Shampoo-Repair.png",
    price: 380,
    purpose: "Очищення, пом'якшення, відновлення",
    hairType: "Для сухого",
    volume: "250 мл",
    note: "Без парабенів",
    madeIn: "Україна",
    composition:
      "Вода, SLES, кокамідопропілбетаїн, екстракт алое, ароматизатор",
    usage: "Нанести на вологе волосся, спінити, змити водою.",
    shirtDescription: "Шампунь створений для сухого, пошкодженого, пористого, середнього та товстого волосся.",
     link: '/',
  },
  {
    id: "Shampoo Trietment",
    name: "Shampoo",
    subname: "Trietment",
    category: "Очищення",
    description:
      "Шампунь створений тонкого та середнього, нормального та схильного до жирності волосся. Дбайливо та делікатно очищає волосся та шкіру голови.  Розгладжує кутикулу, робить його міцнішим, зберігаючи при цьому мʼякість і наділяючи чудовим блиском, перешкоджає його швидкому забрудненню.",
    image: "./Images/CarouselProduct/Shampoo-Trietment.png",
    price: 380,

    purpose: "Очищення, пом'якшення, відновлення",
    hairType: "Для сухого",
    volume: "250 мл",
    note: "Без парабенів",
    madeIn: "Україна",
    composition:
      "Вода, SLES, кокамідопропілбетаїн, екстракт алое, ароматизатор",
    usage: "Нанести на вологе волосся, спінити, змити водою.",
    shirtDescription: "Шампунь створений для сухого, пошкодженого, пористого, середнього та товстого волосся.",
     link: '/',
  },
  {
    id: "Condicioner For all hair types",
    name: "Condicioner",
    subname: "For all hair types",
    category: "Зволоження",
    description:
      "Живить, відновлює, пом'якшує та розгладжує волосся, полегшує розчісування, надає м’якість, еластичність та блиск локонам.",
    image: "./Images/CarouselProduct/Conditioner-For-All-Hair-Types.png",
    price: 380,
    purpose: "Очищення, пом'якшення, відновлення",
    hairType: "Для сухого",
    volume: "250 мл",
    note: "Без парабенів",
    madeIn: "Україна",
    composition:
      "Вода, SLES, кокамідопропілбетаїн, екстракт алое, ароматизатор",
    usage: "Нанести на вологе волосся, спінити, змити водою.",
    shirtDescription: "Шампунь створений для сухого, пошкодженого, пористого, середнього та товстого волосся.",
     link: '/',
  },
  {
    id: "Nektar Hair Oil",
    name: "Nektar",
    subname: "Hair Oil",
    category: "Зволоження",
    description:
      "Згладжувальна і зволожуюча олія. Забезпечує захист від впливу зовнішніх подразників і попереджає руйнування кутикули. Активні компоненти роблять волосся шовковистим і м'яким. Ніжна олія швидко проникає в кутикулу, надаючи поживну і регенеруючу дію, полегшує розчісування, оберігає при гарячому укладанні.",
    image: "./Images/CarouselProduct/Nektar-Hair-Oil.png",
    price: 380,
    purpose: "Очищення, пом'якшення, відновлення",
    hairType: "Для сухого",
    volume: "250 мл",
    note: "Без парабенів",
    madeIn: "Україна",
    composition:
      "Вода, SLES, кокамідопропілбетаїн, екстракт алое, ароматизатор",
    usage: "Нанести на вологе волосся, спінити, змити водою.",
    shirtDescription: "Шампунь створений для сухого, пошкодженого, пористого, середнього та товстого волосся.",
     link: '/',
  },
  {
    id: "Nektar Hair Oil Small",
    name: "Nektar",
    subname: "Hair Oil Small",
    category: "Зволоження",
    description:
      "Згладжувальна і зволожуюча олія. Забезпечує захист від впливу зовнішніх подразників і попереджає руйнування кутикули. Активні компоненти роблять волосся шовковистим і м'яким. Ніжна олія швидко проникає в кутикулу, надаючи поживну і регенеруючу дію, полегшує розчісування, оберігає при гарячому укладанні.",
    image: "./Images/CarouselProduct/Nektar-Hair-Oil-Small.png",
    price: 380,
    purpose: "Очищення, пом'якшення, відновлення",
    hairType: "Для сухого",
    volume: "250 мл",
    note: "Без парабенів",
    madeIn: "Україна",
    composition:
      "Вода, SLES, кокамідопропілбетаїн, екстракт алое, ароматизатор",
    usage: "Нанести на вологе волосся, спінити, змити водою.",
    shirtDescription: "Шампунь створений для сухого, пошкодженого, пористого, середнього та товстого волосся.",
     link: '/',
  },
  {
    id: "Express Conditioner",
    name: "Express",
    subname: "Conditioner",
    category: "Зволоження",
    description:
      "З екстрактом аргани та протеїнами шовку для всіх типів волосся, революційне рішення для догляду за волоссям, створене для живлення, зволоження та слухняності ваших пасм. Ця унікальна формула поєднує в собі зручність спрею з перевагами традиційного кондиціонера, що робить його обов'язковим доповненням до щоденного",
    image: "./Images/CarouselProduct/Express-Conditioner.png",
    price: 380,
    purpose: "Очищення, пом'якшення, відновлення",
    hairType: "Для сухого",
    volume: "250 мл",
    note: "Без парабенів",
    madeIn: "Україна",
    composition:
      "Вода, SLES, кокамідопропілбетаїн, екстракт алое, ароматизатор",
    usage: "Нанести на вологе волосся, спінити, змити водою.",
    shirtDescription: "Шампунь створений для сухого, пошкодженого, пористого, середнього та товстого волосся.",
     link: '/',
  },
  {
    id: "Liquid Silk",
    name: "Liquid",
    subname: "Silk",
    category: "Відновлення",
    description:
      "Робить волосся блискучим та гладким, не обтяжує і не склеює локони. Легка формула, збагачена протеїнами пшениці, додатково пожвавлює пасма, а антистатичні властивості ламелярної води зменшують пухнастість.",
    image: "./Images/CarouselProduct/Liquid-Silk.png",
    price: 380,
    purpose: "Очищення, пом'якшення, відновлення",
    hairType: "Для сухого",
    volume: "250 мл",
    note: "Без парабенів",
    madeIn: "Україна",
    composition:
      "Вода, SLES, кокамідопропілбетаїн, екстракт алое, ароматизатор",
    usage: "Нанести на вологе волосся, спінити, змити водою.",
    shirtDescription: "Шампунь створений для сухого, пошкодженого, пористого, середнього та товстого волосся.",
     link: '/',
  },

  {
    id: "Набір Перший",
    name: "Набір",
    subname: "Перший",
    category: "Комплексні набори!",
    description:
      "Активний ріст, збільшення густини та зволоження. Твій бездоганний помічник у догляді вже тут. Догляд з високим вмістом Ніацинаміду, Органічного Сквалану та Арганового масла, поєднаний із делікатними густими пінами Кокосової Пальми і Кондиціонуючими органічними агентами з Оливкових дерев",
    image: "./Images/CarouselProduct/Комплексні-набори-1.png",
    price: 380,
    purpose: "Очищення, пом'якшення, відновлення",
    hairType: "Для сухого",
    volume: "250 мл",
    note: "Без парабенів",
    madeIn: "Україна",
    composition:
      "Вода, SLES, кокамідопропілбетаїн, екстракт алое, ароматизатор",
    usage: "Нанести на вологе волосся, спінити, змити водою.",
    shirtDescription: "Шампунь створений для сухого, пошкодженого, пористого, середнього та товстого волосся.",
     link: '/',
  },
  {
    id: "Набір Другий",
    name: "Набір",
    subname: "Другий",
    category: "Комплексні набори!",
    description:
      "Активний ріст, збільшення густини та зволоження. Твій бездоганний помічник у догляді вже тут. Догляд з високим вмістом Ніацинаміду, Органічного Сквалану та Арганового масла, поєднаний із делікатними густими пінами Кокосової Пальми і Кондиціонуючими органічними агентами з Оливкових дерев",
    image: "./Images/CarouselProduct/Комплексні-набори-2.png",
    price: 380,
    purpose: "Очищення, пом'якшення, відновлення",
    hairType: "Для сухого",
    volume: "250 мл",
    note: "Без парабенів",
    madeIn: "Україна",
    composition:
      "Вода, SLES, кокамідопропілбетаїн, екстракт алое, ароматизатор",
    usage: "Нанести на вологе волосся, спінити, змити водою.",
    shirtDescription: "Шампунь створений для сухого, пошкодженого, пористого, середнього та товстого волосся.",
     link: '/',
  },
  {
    id: "Набір Третій",
    name: "Набір",
    subname: "Третій",
    category: "Комплексні набори!",
    description:
      "Активний ріст, збільшення густини та зволоження. Твій бездоганний помічник у догляді вже тут. Догляд з високим вмістом Ніацинаміду, Органічного Сквалану та Арганового масла, поєднаний із делікатними густими пінами Кокосової Пальми і Кондиціонуючими органічними агентами з Оливкових дерев",
    image: "./Images/CarouselProduct/Комплексні-набори-3.png",
    price: 380,
    purpose: "Очищення, пом'якшення, відновлення",
    hairType: "Для сухого",
    volume: "250 мл",
    note: "Без парабенів",
    madeIn: "Україна",
    composition:
      "Вода, SLES, кокамідопропілбетаїн, екстракт алое, ароматизатор",
    usage: "Нанести на вологе волосся, спінити, змити водою.",
    shirtDescription: "Шампунь створений для сухого, пошкодженого, пористого, середнього та товстого волосся.",
     link: '/',
  },
  {
    id: "Набір Четвертий",
    name: "Набір",
    subname: "Четвертий",
    category: "Комплексні набори!",
    description:
      "Активний ріст, збільшення густини та зволоження. Твій бездоганний помічник у догляді вже тут. Догляд з високим вмістом Ніацинаміду, Органічного Сквалану та Арганового масла, поєднаний із делікатними густими пінами Кокосової Пальми і Кондиціонуючими органічними агентами з Оливкових дерев",
    image: "./Images/CarouselProduct/Комплексні-набори-4.png",
    price: 380,
    purpose: "Очищення, пом'якшення, відновлення",
    hairType: "Для сухого",
    volume: "250 мл",
    note: "Без парабенів",
    madeIn: "Україна",
    composition:
      "Вода, SLES, кокамідопропілбетаїн, екстракт алое, ароматизатор",
    usage: "Нанести на вологе волосся, спінити, змити водою.",
    shirtDescription: "Шампунь створений для сухого, пошкодженого, пористого, середнього та товстого волосся.",
     link: '/',
  },
];
