import React from 'react'

type Props = {}

const BrandIntroduction = (props: Props) => {
  return (
    <div className="relative bg-light-gray-green  py-20 text-center ">
        <img src="./Images/Привіт-text.psd.svg" alt="Привіт"  className='absolute w-[460px] h-[260px] '/>,
      <div> <p>це бренд</p> <span>TAKOSTA!</span></div>
      <div className="text-white mt-8 text-lg sm:text-xl md:text-2xl lg:text-3xl leading-relaxed">
        <p>Вітає вас у світі краси та догляду!</p>
        <p>У всі віки прекрасна половина людства вигадувала щось незвичайне, щоб турбуватися про свою красу...</p>
        <p>Наша місія - робити ваше волосся сильним, здоровим і блискучим, даруючи вам впевненість у собі кожен день.</p>
        <p>Дозвольте собі доторкнутися до справжньої магії...</p>
        <p>TAKOSTA об'єднує в собі високу якість та індивідуальний підхід, щоб кожна красуня мала змогу насолоджуватися красою та здоров’ям свого волосся.</p>
        <p>Висока якість та професійний підхід - основні принципи, на яких ґрунтується наша продукція. Ми обираємо тільки найкращі інгредієнти, щоб забезпечити найкращі результати для вашого волосся та шкіри голови.</p>
        <p>Приєднуйтесь до нас у подорожі до краси і дбайте про себе разом з ТМ «TAKOSTA»</p>
      </div>
    </div>
  )
}

export default BrandIntroduction